// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
       let first = +prompt('Введіть перше число');
       let second = +prompt('Введіть друге число');
       if (first>second) {
           console.log( first )
       }
       else if (first ===second ) {
           console.log('Введені числа рівні')
       }
       else {
           console.log(second)
       }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//      let numberOfFlat = +prompt('Введіть номер квартири')
//      if ( numberOfFlat>=1 && numberOfFlat<=20 ) {
//            console.log ('1 під"їзд')
//      }
//      else if ( numberOfFlat>=21 && numberOfFlat<=48) {
//            console.log ('2 під"їзд')
//      }
//     else if ( numberOfFlat>=49 && numberOfFlat<=90) {
//           console.log ('3 під"їзд')
//     }
//     else {
//           console.log ('Некоректно введені дані')
//      }


// - Ми маємо змінну number в яку користувач задає числове значення,
// якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//     let number = +prompt('Введіть числове значення')
//     if (number===10) {
//           console.log('Вірно')
//     }
//     else if (number!==10) {
//           console.log('Невірно')
//     }
//     let number
//      number = (+prompt('Введіть числове значення') ===10) ? console.log('Вірно'): console.log('Невірно')



// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення
//     що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//        let temperature = +prompt('Чи ми йдемо сьогодні в Okten на навчання? Введіть температуру')
//        if (temperature>= 10 && temperature <= 22) {
//              alert('Йдемо вчитися!')
//                 console.log('Йдемо вчитися!')
//                 document.write('Йдемо вчитися!')
//        }
//        else {
//              alert('Сидимо вдома і вчимось онлайн!')
//                 console.log( 'Сидимо вдома і вчимось онлайн!')
//                 document.write('Сидимо вдома і вчимось онлайн!' )
//         }



// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5.
// І взалежності від введеного числа нам дається приз. (Авто, Мото, Телефон, і т.д )
// і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
//        let game = +prompt('Введіть число від 1 до 5');
//         switch (game)  {
//           case 1 :
//               alert('Ваш приз - авто');
//               break;
//           case 2 :
//                alert('Ваш приз - мото');
//                break;
//           case 3 :
//               alert('Ваш приз - телефон');
//               break;
//           case 4 :
//               alert ('Ваш приз - телевізор');
//               break;
//           case 5 :
//               alert ('Ваш приз - праска')
//           default :
//               alert('Число не вірне! Спробуйте ще!')
//          }
