//     - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить,
//     до якої четверті години попадає число (в першу, другу, третю или четверту частину години).
//        let time = +prompt('Введіть хвилину від 0 до 59');
//        if (time>=0 && time<=14){
//              console.log('Перша чверть години')
//        }
//        else if (time>=15 && time <=29) {
//            console.log('Друга чверть години')
//        }
//        else if (time>=30 && time <=44) {
//            console.log( 'Третя чверть години' )
//        }
//        else if ( time>=45 && time <=59 ) {
//            console.log('Четверта чверть години')
//        }
//        else {
//            console.log('Некоректно введені дані')
//        }


//     - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду)
//     місяця потрапляє це число (у першу, другу чи третю).
//        let day = +prompt('Введіть порядковий номер дня місяця')
//        if (day >=1 && day<=10 ) {
//            console.log( 'Перша декада місяця')
//        }
//        else if (day>=11 && day<=20)  {
//            console.log ( 'Друга декада місяця'  )
//        }
//        else if (day>=21 && day<=31) {
//            console.log('Третя декада місяця')
//        }
//        else {
//            console.log('Некоректно введені дані')
//        }


//     - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//         Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта
//         - з коротким записом(тернаркою)

          // let test = confirm('???')
          // if ( test === true ) {
          //     console.log('Вірно')
          // }   else {
          //     console.log('Неправильно')
          // }

           // let test = confirm('???')?  'Вірно': 'Неправильно';
           // console.log(test);

//     - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт
//     при a, що дорівнює 1, 0, -3
//     let a = +prompt('Введіть число');
//     if (a!== 0 ){
//     console.log ( 'Вірно' );
//     } else
//     {
//      console.log( 'Невірно')
//     }
//       a =  a !==0  ? console.log ('Вірно'): console.log('Невірно');


//     - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня
//     і на екрані відображається інфа що заплановано на цей день.
//         let week = +prompt('Введіть день тижня від 1 до 7');
//        switch (week) {
//            case 1 :
//                    console.log('Підйом о 07:30', 'Прийняти душ', 'Сніданок');
//                    break;
//            case 2 :
//                    console.log('Підйом о 09:00 ', 'Попрацювати', 'Обід');
//                    break;
//            case 3 :
//                   console.log('Прочитати книгу', 'Сходити в кіно', 'Зустрітись з друзями');
//                   break;
//            case 4 :
//                   console.log('Підйом о 06:00 ', 'Сходити на пробіжку', 'Сніданок',);
//                   break;
//            case 5 :
//                   console.log('Сніданок', 'Робоча зустріч', 'Перерва на каву');
//                   break;
//            case 6 :
//                   console.log('Сніданок', 'Шопінг', 'Обід');
//                   break;
//            case 7 :
//                   console.log('Сніданок', 'Зустріч з друзями', 'Відпочинок');
//                   break;
//            default:
//                      console.log('Ти щось не то ввів');
//        }


//     - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
//      let year = + prompt('Введіть кількість днів в році');
//      if (year % 4 ===0)  {
//          console.log ('Високосний' );
//      }
//         else {
//             console.log('Невисокосний')

      // let year;
      // year = (+prompt('Введіть кількість днів в році') % 4 === 0) ? console.log('Високосний') :
      // console.log('Невисокосний');



//
//     - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна»
//     назва JavaScript?“ Якщо користувач вводить «ECMAScript», то показати: «Правильно!»,
//     інакше – відобразити: «Не знаєте? ECMAScript!


   // let officialName = prompt('Яка "офіційна" назва Javascript?');
   // if (officialName === 'ECMAScript') {
   //     alert('Правильно!')
   // } else {
   //     alert('Не знаєте? ECMAScript!')
   // }
